xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/Device/Nuvoton/NANO1xx/Include/nano1xx.h
/*  
 *  PDMA Global Control Registers
 */
typedef struct
{
  __IO uint32_t  CSR;                        	 /*!< Offset: 0x0000   DMA Global Control Register                    */
  __IO uint32_t  PDSSR0;                         /*!< Offset: 0x0004   DMA Service Selection Control Register 0       */
  __IO uint32_t  PDSSR1;                         /*!< Offset: 0x0008   DMA Service Selection Control Register 1       */
  __I  uint32_t  ISR;                        	 /*!< Offset: 0x000C   DMA Global Interrupt Register                  */
} PDMAGCR_TypeDef;


/*  
 *  PDMA CRC Control Registers
 */
typedef struct
{
  __IO uint32_t  CTL;
  __IO uint32_t  DMASAR;
       uint32_t  RESERVED0;
  __IO uint32_t  DMABCR;
       uint32_t  RESERVED1;
  __I  uint32_t  DMACSAR;
       uint32_t  RESERVED2;
  __I  uint32_t  DMACBCR;
  __IO uint32_t  DMAIER;
  __IO uint32_t  DMAISR;
       uint32_t  RESERVED3[22];
  __IO uint32_t  WDATA;
  __IO uint32_t  SEED;
  __I  uint32_t  CHECKSUM;
} PDMACRC_TypeDef;
/*@}*/ /* end of group NANO1xx_PDMA */


/*------------- Flash Memory Controller (FMC) -----------------------------*/
/** @addtogroup NANO1xx_FMC NANO1xx Flash Memory Controller Register (FMC)
  @{
*/
typedef struct
{
  __IO uint32_t  ISPCON;					/*!< Offset: 0x0000   ISP Control Register                               */
  __IO uint32_t  ISPADR;					/*!< Offset: 0x0004   ISP Address Register                               */ 
  __IO uint32_t  ISPDAT;					/*!< Offset: 0x0008   ISP Data Register                                  */ 
  __IO uint32_t  ISPCMD;					/*!< Offset: 0x000C   ISP Command Register                               */
  __IO uint32_t  ISPTRG;					/*!< Offset: 0x0010   ISP Trigger Register                               */
  __I  uint32_t  DFBADR;					/*!< Offset: 0x0014   Data Flash Start Address (CONFIG1)                 */ 
  __I  uint32_t  RESERVED0[10];
  __IO uint32_t  ISPSTA;					/*!< Offset: 0x0040   ISP Status Register                                */
} FMC_TypeDef;
/*@}*/ /* end of group NANO1xx_FMC */


/*------------- External Bus Interface Control Register (EBI) -----------------------------*/
/** @addtogroup NANO1xx_EBI NANO1xx External Bus Interfacel Control Register (EBI)
  @{
*/
typedef struct
{
  __IO uint32_t  EBICON;					/*!< Offset: 0x0000   EBI general control register                       */
  __IO uint32_t  EXTIME;					/*!< Offset: 0x0004   EBI timing control register                        */
} EBI_TypeDef;
/*@}*/ /* end of group NANO1xx_EBI */


/*------------- Watchdog Timer Control Register (WDT) -----------------------------*/
/** @addtogroup NANO1xx_WDT NANO1xx Watchdog Timer Control Register (WDT)
  @{
*/
typedef struct
{
  __IO uint32_t  CTL;						/*!< Offset: 0x0000   Watchdog Timer Control Register   		         */
  __IO uint32_t  IER;						/*!< Offset: 0x0004   Watchdog Timer Interrupt Enable Register 			 */
  __IO uint32_t  ISR;						/*!< Offset: 0x0008   Watchdog Timer Interrupt Status Register 			 */

} WDT_TypeDef;
/*@}*/ /* end of group NANO1xx_WDT */


/*------------- Window Watchdog Timer Control Register (WWDT) -----------------------------*/
/** @addtogroup NANO1xx_WWDT NANO1xx Watchdog Timer Control Register (WWDT)
  @{
*/
typedef struct
{
  __O  uint32_t  RLD;						/*!< Offset: 0x0000   Window Watchdog Timer Reload Counter Register		 */
  __IO uint32_t  CR;						/*!< Offset: 0x0004   Window Watchdog Timer Control Register	    		 */
  __IO uint32_t  IER;						/*!< Offset: 0x0008   Window Watchdog Timer Interrupt Enable Register		 */
  __IO uint32_t  STS;						/*!< Offset: 0x000C   Window Watchdog Timer Status Register			 */
  __I  uint32_t  VAL;						/*!< Offset: 0x0010   Window Watchdog Counter Value Register			 */
} WWDT_TypeDef;
/*@}*/ /* end of group NANO1xx_WWDT */


/*----------------------------- Real Time Clock Controller -------------------------------*/
/** @addtogroup NANO1xx_RTC NANO1xx Real Time Clock (RTC)
  @{
*/
typedef struct
{
  __IO uint32_t  INIR;		/*!< Offset: 0x0000   RTC Initiation Register	  	       	*/
  __IO uint32_t  AER;		/*!< Offset: 0x0004   RTC Access Enable Register  	     	*/
  __IO uint32_t  FCR;		/*!< Offset: 0x0008   RTC Frequency Compensation Register	*/
  __IO uint32_t  TLR;		/*!< Offset: 0x000C   Time Loading Register					*/
  __IO uint32_t  CLR;		/*!< Offset: 0x0010   Calendar Loading Register				*/
  __IO uint32_t  TSSR;		/*!< Offset: 0x0014   Time Scale Selection Register			*/
  __IO uint32_t  DWR;		/*!< Offset: 0x0018   Day of the Week Register				*/
  __IO uint32_t  TAR;		/*!< Offset: 0x001C   Time Alarm Register					*/
  __IO uint32_t  CAR;		/*!< Offset: 0x0020   Calendar Alarm Register				*/
  __I  uint32_t  LIR;		/*!< Offset: 0x0024   Leap year Indicator Register			*/
  __IO uint32_t  RIER;		/*!< Offset: 0x0028   RTC Interrupt Enable Register			*/
  __IO uint32_t  RIIR;		/*!< Offset: 0x002C   RTC Interrupt Indicator Register		*/
  __IO uint32_t  TTR;		/*!< Offset: 0x0030   RTC Time Tick Register				*/
  uint32_t  RESERVED0[2];
  __IO uint32_t  SPRCTL;	/*!< Offset: 0x003C   RTC Spare Functional Control Register	*/
  __IO uint32_t  SPR0;		/*!< Offset: 0x0040   RTC Spare Register 0					*/
  __IO uint32_t  SPR1;		/*!< Offset: 0x0044   RTC Spare Register 1					*/
  __IO uint32_t  SPR2;		/*!< Offset: 0x0048   RTC Spare Register 2					*/
  __IO uint32_t  SPR3;		/*!< Offset: 0x004C   RTC Spare Register 3					*/
  __IO uint32_t  SPR4;		/*!< Offset: 0x0050   RTC Spare Register 4					*/
  __IO uint32_t  SPR5;		/*!< Offset: 0x0054   RTC Spare Register 5					*/
  __IO uint32_t  SPR6;		/*!< Offset: 0x0058   RTC Spare Register 6					*/
  __IO uint32_t  SPR7;		/*!< Offset: 0x005C   RTC Spare Register 7					*/
  __IO uint32_t  SPR8;		/*!< Offset: 0x0060   RTC Spare Register 8					*/
  __IO uint32_t  SPR9;		/*!< Offset: 0x0064   RTC Spare Register 9					*/
  __IO uint32_t  SPR10;		/*!< Offset: 0x0068   RTC Spare Register 10					*/
  __IO uint32_t  SPR11;		/*!< Offset: 0x006C   RTC Spare Register 11					*/
  __IO uint32_t  SPR12;		/*!< Offset: 0x0070   RTC Spare Register 12					*/
  __IO uint32_t  SPR13;		/*!< Offset: 0x0074   RTC Spare Register 13					*/
  __IO uint32_t  SPR14;		/*!< Offset: 0x0078   RTC Spare Register 14					*/
  __IO uint32_t  SPR15;		/*!< Offset: 0x007C   RTC Spare Register 15					*/
  __IO uint32_t  SPR16;		/*!< Offset: 0x0080   RTC Spare Register 16					*/
  __IO uint32_t  SPR17;		/*!< Offset: 0x0084   RTC Spare Register 17					*/
  __IO uint32_t  SPR18;		/*!< Offset: 0x0088   RTC Spare Register 18					*/
  __IO uint32_t  SPR19;		/*!< Offset: 0x008C   RTC Spare Register 19					*/
} RTC_TypeDef;
