xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/Device/Nuvoton/NANO1xx/Include/nano1xx.h
/*@}*/ /* end of group NANO1xx_RTC */


/*----------------------------- ADC Controller -------------------------------*/
/** @addtogroup NANO1xx_ADC NANO1xx A/D Converter (ADC)
  @{
*/
typedef struct
{
  __I  uint32_t  RESULT0;					/*!< Offset: 0x0000   A/D result Register 0								 */
  __I  uint32_t  RESULT1;					/*!< Offset: 0x0004   A/D result Register 1								 */
  __I  uint32_t  RESULT2;					/*!< Offset: 0x0008   A/D result Register 2								 */
  __I  uint32_t  RESULT3;					/*!< Offset: 0x000C   A/D result Register 3								 */
  __I  uint32_t  RESULT4;					/*!< Offset: 0x0010   A/D result Register 4								 */
  __I  uint32_t  RESULT5;					/*!< Offset: 0x0014   A/D result Register 5								 */
  __I  uint32_t  RESULT6;					/*!< Offset: 0x0018   A/D result Register 6								 */
  __I  uint32_t  RESULT7;					/*!< Offset: 0x001C   A/D result Register 7								 */
  __I  uint32_t  RESULT8;					/*!< Offset: 0x0020   A/D result Register 8								 */
  __I  uint32_t  RESULT9;					/*!< Offset: 0x0024   A/D result Register 9								 */
  __I  uint32_t  RESULT10;					/*!< Offset: 0x0028   A/D result Register 10							 */
  __I  uint32_t  RESULT11;					/*!< Offset: 0x002C   A/D result Register 11							 */
  __I  uint32_t  RESULT12;					/*!< Offset: 0x0030   A/D result Register 12							 */
  __I  uint32_t  RESULT13;					/*!< Offset: 0x0034   A/D result Register 13							 */
  __I  uint32_t  RESULT14;					/*!< Offset: 0x0038   A/D result Register 14							 */
  __I  uint32_t  RESULT15;					/*!< Offset: 0x003C   A/D result Register 15							 */				 
  __I  uint32_t  RESULT16;					/*!< Offset: 0x0040   A/D result Register 16							 */
  __I  uint32_t  RESULT17;					/*!< Offset: 0x0044   A/D result Register 17							 */
  __IO uint32_t  CR;						/*!< Offset: 0x0048   A/D Control Register 								 */
  __IO uint32_t  CHER;						/*!< Offset: 0x004C   A/D Channel Enable Register						 */
  __IO uint32_t  CMPR0;						/*!< Offset: 0x0050   A/D Compare Register 0							 */
  __IO uint32_t  CMPR1;						/*!< Offset: 0x0054   A/D Compare Register 1							 */
  __IO uint32_t  SR;						/*!< Offset: 0x0058   A/D Status Register								 */
  uint32_t  RESERVED0;						/*!< Offset: 0x005C   Reserved                                           */
  __I  uint32_t  PDMA;  					/*!< Offset: 0x0060   A/D PDMA Current Transfer Data Register            */
  __IO uint32_t  PWRCTL;					/*!< Offset: 0x0064   A/D Power Control Register                         */
  __IO uint32_t  CALCTL;					/*!< Offset: 0x0068   A/D Calibration Control Register                   */
  __IO uint32_t  CALWORD;					/*!< Offset: 0x006C   A/D Calibration Load Word Register                 */
  __IO uint32_t  SMPLCNT0;					/*!< Offset: 0x0070   A/D Sample Register 0                              */
  __IO uint32_t  SMPLCNT1;					/*!< Offset: 0x0074   A/D Sample Register 1                              */
} ADC_TypeDef;
/*@}*/ /* end of group NANO1xx_ADC */


/*------------- I2S Control Register (I2S) -----------------------------*/
/** @addtogroup NANO1xx_I2S NANO1xx I2S Control Register (I2S)
  @{
*/
typedef struct
{
  __IO uint32_t  CTRL;					/*!< Offset: 0x0000   I2S Control Register                               */
  __IO uint32_t  CLKDIV;				/*!< Offset: 0x0004   I2S Clock Divider Register                         */
  __IO uint32_t  INTEN;					/*!< Offset: 0x0008   I2S Interrupt Enable Register                      */
  __IO uint32_t  STATUS;				/*!< Offset: 0x000C   I2S Status Register                                */
  __O uint32_t  TXFIFO;					/*!< Offset: 0x0010   I2S Transmit FIFO Register                         */
  __I uint32_t  RXFIFO;					/*!< Offset: 0x0014   I2S Receive FIFO Register                          */
} I2S_TypeDef;
/*@}*/ /* end of group NANO1xx_I2S */


/*------------- USB Device Control Register (USBD) -----------------------------*/
/** @addtogroup NANO1xx_USBD NANO1xx USB Device Control Register (USBD)
  @{
*/
typedef struct
{
  __IO uint32_t  CTRL;                           /*!< Offset: 0x0000   USB Control Register                           */ 
  __I  uint32_t  BUSSTS;                         /*!< Offset: 0x0004   USB Bus Status Register                        */ 
  __IO uint32_t  INTEN;                          /*!< Offset: 0x0008   USB Interrupt Enable Register                  */ 
  __IO uint32_t  INTSTS;                         /*!< Offset: 0x000C   USB Interrupt Event Status Register            */ 
  __IO uint32_t  DADDR;                          /*!< Offset: 0x0010   USB Device's Function Address Register         */ 
  __I  uint32_t  EPSTS;                          /*!< Offset: 0x0014   USB Endpoint Status Register                   */ 
  __IO uint32_t  BUFSEG;                         /*!< Offset: 0x0018   USB Setup Token Buffer Segmentation Register   */ 
  __I  uint32_t  EPSTS2;                         /*!< Offset: 0x001C   USB Endpoint Status Register 2                 */ 
  __IO uint32_t  BUFSEG0;                        /*!< Offset: 0x0020   USB Endpoint 0 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD0;                         /*!< Offset: 0x0024   USB Endpoint 0 Maximal Payload Register        */ 
  __IO uint32_t  CFG0;                           /*!< Offset: 0x0028   USB Endpoint 0 Configuration Register          */ 
       uint32_t  RESERVED1;                      /*!< Offset: 0x002C   Reserved                                       */ 
  __IO uint32_t  BUFSEG1;                        /*!< Offset: 0x0030   USB Endpoint 1 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD1;                         /*!< Offset: 0x0034   USB Endpoint 1 Maximal Payload Register        */ 
  __IO uint32_t  CFG1;                           /*!< Offset: 0x0038   USB Endpoint 1 Configuration Register          */ 
       uint32_t  RESERVED2;                      /*!< Offset: 0x003C   Reserved                                       */ 
  __IO uint32_t  BUFSEG2;                        /*!< Offset: 0x0040   USB Endpoint 2 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD2;                         /*!< Offset: 0x0044   USB Endpoint 2 Maximal Payload Register        */ 
  __IO uint32_t  CFG2;                           /*!< Offset: 0x0048   USB Endpoint 2 Configuration Register          */ 
       uint32_t  RESERVED3;                      /*!< Offset: 0x004C   Reserved                                       */ 
  __IO uint32_t  BUFSEG3;                        /*!< Offset: 0x0050   USB Endpoint 3 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD3;                         /*!< Offset: 0x0054   USB Endpoint 3 Maximal Payload Register        */ 
  __IO uint32_t  CFG3;                           /*!< Offset: 0x0058   USB Endpoint 3 Configuration Register          */ 
       uint32_t  RESERVED4;                      /*!< Offset: 0x005C   Reserved                                       */ 
  __IO uint32_t  BUFSEG4;                        /*!< Offset: 0x0060   USB Endpoint 4 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD4;                         /*!< Offset: 0x0064   USB Endpoint 4 Maximal Payload Register        */ 
  __IO uint32_t  CFG4;                           /*!< Offset: 0x0068   USB Endpoint 4 Configuration Register          */ 
       uint32_t  RESERVED5;                      /*!< Offset: 0x006C   Reserved                                       */ 
  __IO uint32_t  BUFSEG5;                        /*!< Offset: 0x0070   USB Endpoint 5 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD5;                         /*!< Offset: 0x0074   USB Endpoint 5 Maximal Payload Register        */ 
  __IO uint32_t  CFG5;                           /*!< Offset: 0x0078   USB Endpoint 5 Configuration Register          */ 
       uint32_t  RESERVED6;                      /*!< Offset: 0x007C   Reserved                                       */ 
  __IO uint32_t  BUFSEG6;                        /*!< Offset: 0x0080   USB Endpoint 6 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD6;                         /*!< Offset: 0x0084   USB Endpoint 6 Maximal Payload Register        */ 
  __IO uint32_t  CFG6;                           /*!< Offset: 0x0088   USB Endpoint 6 Configuration Register          */ 
       uint32_t  RESERVED7;                      /*!< Offset: 0x008C   Reserved                                       */ 
  __IO uint32_t  BUFSEG7;                        /*!< Offset: 0x0090   USB Endpoint 7 Buffer Segmentation Register    */ 
  __IO uint32_t  MXPLD7;                         /*!< Offset: 0x0094   USB Endpoint 7 Maximal Payload Register        */ 
  __IO uint32_t  CFG7;                           /*!< Offset: 0x0098   USB Endpoint 7 Configuration Register          */ 
       uint32_t  RESERVED8[2];                   /*!< Offset: 0x009C~0x00A0   Reserved                                       */ 
  __IO uint32_t  PDMA;                           /*!< Offset: 0x00A4   USB PDMA Control Register                           */ 
} USBD_TypeDef;
/*@}*/ /* end of group NANO1xx_USBD */


/*------------- DAC (DAC) -----------------------------*/
/** @addtogroup NANO1xx_DAC NANO1xx DAC Control Register (DAC)
  @{
*/
typedef struct
{
  __IO uint32_t  CTL0;						/*!< Offset: 0x0000   DAC0 Control Register                              */
  __IO uint32_t  DATA0;						/*!< Offset: 0x0004   DAC0 Data Register                                 */
  __IO uint32_t  STS0;						/*!< Offset: 0x0008   DAC0 Status Register                               */
  uint32_t  RESERVED0;						/*!< Offset: 0x000C   Reserved                                           */
  __IO uint32_t  CTL1;						/*!< Offset: 0x0010   DAC1 Control Register                              */
  __IO uint32_t  DATA1;						/*!< Offset: 0x0014   DAC1 Data Register                                 */
  __IO uint32_t  STS1;						/*!< Offset: 0x0018   DAC1 Status Register                               */
  uint32_t  RESERVED1;						/*!< Offset: 0x001C   Reserved                                           */
  __IO uint32_t  COMCTL;					/*!< Offset: 0x0020   DAC01 Common Control Register                      */
} DAC_TypeDef;
