xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/Device/Nuvoton/NANO1xx/Include/nano1xx.h
/*@}*/ /* end of group NANO1xx_PWM */


/*-------------------- Serial Peripheral Interface (SPI) ----------------------*/
/** @addtogroup NANO1xx_SPI NANO1xx Serial Peripheral Interface (SPI)
  @{
 */
typedef struct
{
  __IO uint32_t  CTL;						/*!< Offset: 0x0000   SPI Control Register                               */
  __IO uint32_t  STATUS;					/*!< Offset: 0x0004   SPI Status  Register                               */
  __IO uint32_t  CLKDIV;					/*!< Offset: 0x0008   SPI Serial Clock Divider Register                  */
  __IO uint32_t  SSR;						/*!< Offset: 0x000C   SPI Slave Select Register                          */
  __I  uint32_t  RX0;						/*!< Offset: 0x0010   SPI Receive Data FIFO Register 0                   */
  __I  uint32_t  RX1;						/*!< Offset: 0x0014   SPI Receive Data FIFO Register 1                   */
       uint32_t  RESERVED0;
       uint32_t  RESERVED1;
  __O  uint32_t  TX0;						/*!< Offset: 0x0020   SPI Transmit Data FIFO Register 0                  */
  __O  uint32_t  TX1;						/*!< Offset: 0x0024   SPI Transmit Data FIFO Register 1                  */
       uint32_t  RESERVED2;
       uint32_t  RESERVED3;
       uint32_t  RESERVED4;
  __IO uint32_t  VARCLK;					/*!< Offset: 0x0034   SPI Variable Clock Pattern Flag Register           */
  __IO uint32_t  PDMA;						/*!< Offset: 0x0038   SPI PDMA Control Register                          */
  __IO uint32_t  FF_CTL;					/*!< Offset: 0x003C   SPI FIFO Control Register                          */
} SPI_TypeDef;
/*@}*/ /* end of group NANO1xx_SPI */


/*------------- UART -----------------------------*/
/** @addtogroup NANO1xx_UART NANO1xx UART Control Register (UART)
  @{
*/
typedef struct
{
  union {
  __I  uint32_t  RBR;		/*!< Offset: 0x0000   UART Receive Buffer Register  	       */
  __O  uint32_t  THR;		/*!< Offset: 0x0000   UART Transmit Holding Register  	       */
  };
  __IO uint32_t  CTL;		/*!< Offset: 0x0004   UART Control State Register	  	       */
  __IO uint32_t  TLCTL;		/*!< Offset: 0x0008   UART Transfer Line Control Register       */
  __IO uint32_t  IER;		/*!< Offset: 0x000C   UART Interrupt Enable Register	       */
  __IO uint32_t  ISR;		/*!< Offset: 0x0010   UART Interrupt Status Register	       */
  __IO uint32_t  TRSR;		/*!< Offset: 0x0014   UART Transfer State Status Register       */
  __IO uint32_t  FSR;		/*!< Offset: 0x0018   UART FIFO State Status Register	       */
  __IO uint32_t  MCSR;		/*!< Offset: 0x001C   UART Modem State Status Register	       */
  __IO uint32_t  TMCTL;		/*!< Offset: 0x0020   UART Time-Out Control State Register       */
  __IO uint32_t  BAUD;		/*!< Offset: 0x0024   UART Baud Rate Divisor Register     		  */
  uint32_t  RESERVED0[2];
  __IO uint32_t  IRCR;		/*!< Offset: 0x0030   UART IrDA Control Register	     		  */
  __IO uint32_t  ALT_CTL;	/*!< Offset: 0x0034   UART Alternate Control State Register		  */
  __IO uint32_t  FUN_SEL;	/*!< Offset: 0x0038   UART Function Select Register				  */
} UART_TypeDef;
/*@}*/ /* end of group NANO1xx_UART */		    



/*
 * @brief GPIO shadow registers
 */
/*------------- GPIO Shadow Registers (SHADOW) -----------------------------*/
/** @addtogroup NANO1xx_SHADOW NANO1xx GPIO Shadow Register (SHADOW)
  @{
*/ 
typedef struct
{
   __I uint32_t  GPA_SHADOW;				/*!< Offset: 0x0000   GPIO Port A Pin Value Shadow Register 	  		 */
   __I uint32_t  GPB_SHADOW;				/*!< Offset: 0x0004   GPIO Port B Pin Value Shadow Register 	  		 */
   __I uint32_t  GPC_SHADOW;				/*!< Offset: 0x0008   GPIO Port C Pin Value Shadow Register 	  		 */
   __I uint32_t  GPD_SHADOW;				/*!< Offset: 0x000C   GPIO Port D Pin Value Shadow Register 	  		 */
   __I uint32_t  GPE_SHADOW;				/*!< Offset: 0x0010   GPIO Port E Pin Value Shadow Register 	  		 */
   __I uint32_t  GPF_SHADOW;				/*!< Offset: 0x0014   GPIO Port F Pin Value Shadow Register 	  		 */
} SHADOW_TypeDef;
/*@}*/ /* end of group NANO1xx_SHADOW */



/*------------- I2C Serial Interface Controller (Master/Slave) (I2C) -----------------------------*/
/** @addtogroup NANO1xx_I2C NANO1xx I2C Controller Register (I2C)
  @{
*/
typedef struct
{
   __IO uint32_t  CON;					/*!< Offset: 0x0000   I2C Control Register                               */
   __IO uint32_t  INTSTS;				/*!< Offset: 0x0004   I2C Control Flag Register                          */
   __I  uint32_t  STATUS;				/*!< Offset: 0x0008   I2C Status Register                                */
   __IO uint32_t  DIV;					/*!< Offset: 0x000C   I2C Clock Divided Register                         */
   __IO uint32_t  TOUT;					/*!< Offset: 0x0010   I2C Time Out Control Register                      */
   __IO uint32_t  DATA;					/*!< Offset: 0x0014   I2C Data Register                                  */
   __IO uint32_t  SADDR0;				/*!< Offset: 0x0018   Slave Address Register 0                           */
   __IO uint32_t  SADDR1;				/*!< Offset: 0x001C   Slave Address Register 1                           */
        uint32_t  RESERVED0;
        uint32_t  RESERVED1;
   __IO uint32_t  SAMASK0;				/*!< Offset: 0x0028   Slave Address Mask Register 0                      */
   __IO uint32_t  SAMASK1;				/*!< Offset: 0x002C   Slave Address Mask Register 1                      */
   		uint32_t  RESERVED2[4];
   __IO uint32_t  WKUPCON;				/*!< Offset: 0x003C   I2C Wake-up Control Register                       */
   __IO uint32_t  WKUPSTS;				/*!< Offset: 0x0040   I2C Wake-up Status Register                        */
  
} I2C_TypeDef;
/*@}*/ /* end of group NANO1xx_I2C */


/*------------- Smart Card Control Register (SC) -----------------------------*/
/** @addtogroup NANO1xx_SC NANO1xx Smart Card Control Register (SC)
  @{
*/
typedef struct
{
  union {
  __I  uint32_t  RBR;						/*!< Offset: 0x0000  SC Receiving Buffer Register				 	 	 */
  __O  uint32_t  THR;						/*!< Offset: 0x0000  SC Transmit Holding Register				 	 	 */
  };
  __IO uint32_t  CTL;						/*!< Offset: 0x0004  SC Control Register						 	 	 */
  __IO uint32_t  ALTCTL;					/*!< Offset: 0x0008  SC Alternate Control Register				 	 	 */
  __IO uint32_t  EGTR;						/*!< Offset: 0x000C  SC Extend Guard Time Register				 	 	 */
  __IO uint32_t  RFTMR;						/*!< Offset: 0x0010  SC Receive Buffer Time-Out Register		 	 	 */
  __IO uint32_t  ETUCR;						/*!< Offset: 0x0014  SC ETU Control Register					 	 	 */
  __IO uint32_t  IER;						/*!< Offset: 0x0018  SC Interrupt Enable Register				 	 	 */
  __IO uint32_t  ISR;						/*!< Offset: 0x001C  SC Interrupt Status Register				 	 	 */
  __IO uint32_t  TRSR;						/*!< Offset: 0x0020  SC Transfer Status Register				 	 	 */
  __IO uint32_t  PINCSR;					/*!< Offset: 0x0024  SC Pin Control State Register				 	 	 */
  __IO uint32_t  TMR0;						/*!< Offset: 0x0028  SC Internal Timer Control Register 0		 	 	 */
  __IO uint32_t  TMR1;						/*!< Offset: 0x002C  SC Internal Timer Control Register 1		 	 	 */
  __IO uint32_t  TMR2;						/*!< Offset: 0x0030  SC Internal Timer Control Register 2		 	 	 */
  __IO uint32_t  UACTL;						/*!< Offset: 0x0034  SC UART Mode Control Register				 	 	 */
  __I  uint32_t  TDRA;
  __I  uint32_t  TDRB;  
} SC_TypeDef;
/*@}*/ /* end of group NANO1xx_SC */


#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

/*@}*/ /* end of group NANO1xx_Peripherals */


/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/** @addtogroup NANO1xx_MemoryMap NANO1xx Memory Mapping
  @{
*/

/* Peripheral and SRAM base address */
//#define <DeviceAbbreviation>_FLASH_BASE       (0x00000000UL)           /*!< (FLASH     ) Base Address */
#define SRAM_BASE            (0x20000000UL)                              /*!< (SRAM      ) Base Address */
#define PERIPH_BASE          (0x40000000UL)                              /*!< (Peripheral) Base Address */


/* Peripheral memory map */
#define APB1PERIPH_BASE       PERIPH_BASE
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x100000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x10000000)

#define WDT_BASE	          (APB1PERIPH_BASE + 0x04000)
#define WWDT_BASE	          (APB1PERIPH_BASE + 0x04100)
#define RTC_BASE	          (APB1PERIPH_BASE + 0x08000)
#define TIMER0_BASE	          (APB1PERIPH_BASE + 0x10000)
#define TIMER1_BASE	          (APB1PERIPH_BASE + 0x10100)
#define I2C0_BASE	          (APB1PERIPH_BASE + 0x20000)
#define SPI0_BASE	          (APB1PERIPH_BASE + 0x30000)
#define PWM0_BASE	          (APB1PERIPH_BASE + 0x40000)
#define UART0_BASE	          (APB1PERIPH_BASE + 0x50000)
#define USBD_BASE	          (APB1PERIPH_BASE + 0x60000)
#define USBD_SRAM_BASE	      (APB1PERIPH_BASE + 0x60100)
#define DAC_BASE	          (APB1PERIPH_BASE + 0xA0000)
#define LCD_BASE	          (APB1PERIPH_BASE + 0xB0000)
#define TK_BASE	              (APB1PERIPH_BASE + 0xC0000)
#define SPI2_BASE             (APB1PERIPH_BASE + 0xD0000)
#define ADC_BASE	          (APB1PERIPH_BASE + 0xE0000)

#define TIMER2_BASE	          (APB2PERIPH_BASE + 0x10000)
#define TIMER3_BASE	          (APB2PERIPH_BASE + 0x10100)
#define SHADOW_BASE	   		  (APB1PERIPH_BASE + 0x10200)
#define I2C1_BASE	          (APB2PERIPH_BASE + 0x20000)
#define SPI1_BASE	          (APB2PERIPH_BASE + 0x30000)
#define PWM1_BASE	          (APB2PERIPH_BASE + 0x40000)
#define UART1_BASE	          (APB2PERIPH_BASE + 0x50000)
#define SC0_BASE	          (APB2PERIPH_BASE + 0x90000)
#define I2S_BASE	          (APB2PERIPH_BASE + 0xA0000)
#define SC1_BASE	          (APB2PERIPH_BASE + 0xB0000)
#define SC2_BASE	          (APB2PERIPH_BASE + 0xC0000)

